Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/FRKE_old/FRKE_old.tmx
Source language: en_us
Languages: de_de

source: a read transistor and a lower select transistor that are arranged in series, the lower select transistor having a source electrically coupled to the reference signal line and a gate electrically coupled to the erase line, the read transistor having a gate electrically coupled to the floating gate node and a source directly connected to the first common node; or
de_de: einen Lesetransistor und einen unteren Auswahltransistor, die in Reihe angeordnet sind, wobei der untere Auswahltransistor eine Quelle aufweist, die elektrisch mit der Referenzsignalleitung gekoppelt ist, und ein Gate, das elektrisch mit der Löschleitung gekoppelt ist, wobei der Lesetransistor ein Gate aufweist, das elektrisch mit dem schwebenden Gate-Knoten gekoppelt ist, und eine Quelle, die direkt mit dem ersten gemeinsamen Knoten verbunden ist; oder

source: a third input signal line for providing a third input signal;
de_de: eine dritte Eingangssignalleitung zum Bereitstellen eines dritten Eingangssignals;

source: a fourth input signal line for providing a fourth input signal;
de_de: eine vierte Eingangssignalleitung zum Bereitstellen eines vierten Eingangssignals;

source: wherein each of first and second cells (832, 834) further includes:
de_de: wobei jede der ersten und zweiten Zellen (832, 834) ferner Folgendes beinhaltet:

source: a third upper select transistor having a gate that is electrically coupled to the third input signal line; and
de_de: einen dritten oberen Auswahltransistor, der ein Gate aufweist, das elektrisch mit der dritten Eingangssignalleitung gekoppelt ist; und

source: a fourth upper select transistor having a gate that is electrically coupled to the fourth input signal line, the source of the third upper select transistor and the source of the fourth upper select transistor being directly connected to a second common node,
de_de: einen vierten oberen Auswahltransistor, der ein Gate aufweist, das elektrisch mit der vierten Eingangssignalleitung gekoppelt ist, wobei die Quelle des dritten oberen Auswahltransistors und die Quelle des vierten oberen Auswahltransistors direkt mit einem zweiten gemeinsamen Knotenpunkt verbunden sind,

source: a second variable resistor having one end connected to second common node and another end electrically coupled to the reference signal line, a value of the second variable resistor being programmable to change a magnitude of an output signal,
de_de: einen zweiten variablen Widerstand, der ein Ende aufweist, das mit dem zweiten gemeinsamen Knotenpunkt verbunden ist und ein anderes Ende, das elektrisch mit der Referenzsignalleitung gekoppelt ist, wobei der Wert des zweiten variablen Widerstands programmierbar ist, um die Größe eines Ausgangssignals zu ändern,

source: wherein a drain of the third upper select transistor of the first cell is electrically coupled to the first output line and a drain of the third upper select transistor of the second cell is electrically coupled to the second output line and
de_de: wobei ein Drain des dritten oberen Auswahltransistors der ersten Zelle elektrisch mit der ersten Ausgangsleitung gekoppelt ist und ein Drain des dritten oberen Auswahltransistors der zweiten Zelle elektrisch mit der zweiten Ausgangsleitung gekoppelt ist und

source: wherein a drain of the fourth upper select transistor of the first cell is electrically coupled to the second output line and a drain of the fourth upper select transistor of the second cell is electrically coupled to the first output line.
de_de: wobei ein Drain des vierten oberen Auswahltransistors der ersten Zelle elektrisch mit der zweiten Ausgangsleitung gekoppelt ist und ein Drain des vierten oberen Auswahltransistors der zweiten Zelle elektrisch mit der ersten Ausgangsleitung gekoppelt ist.

source: 8. The non-volatile neural network of claim 4, wherein the first output signal (261) is a sum of a first current signal and an offset current signal, the second output signal (262) is a sum of a second current signal and the offset current signal, and the first current signal has an opposite polarity to the second current signal.
de_de: 8. Nichtflüchtiges neuronales Netz nach Anspruch 4, wobei das erste Ausgangssignal (261) eine Summe aus einem ersten Stromsignal und einem Versatzstromsignal ist, das zweite Ausgangssignal (262) eine Summe aus einem zweiten Stromsignal und dem Versatzstromsignal ist und das erste Stromsignal eine entgegengesetzte Polarität zum zweiten Stromsignal aufweist.

source: 9. The non-volatile neural network of claim 4, wherein the first variable resistor (313) stores a programmable weight value associated with each cell; or
de_de: 9. Nichtflüchtiges neuronales Netz nach Anspruch 4, wobei der erste variable Widerstand (313) einen programmierbaren Gewichtungswert speichert, der jeder Zelle zugeordnet ist; oder

source: Claims:
de_de: Patentansprüche:

source: 1. A method for determining Advanced Driver Assistance Systems features in a first vehicle (100), and making adjustments to the speed and direction of an autonomous second vehicle (200), the method comprising:
de_de: 1. Verfahren zur Bestimmung der Merkmale fortgeschrittener Fahrerassistenzsysteme in einem ersten Fahrzeug (100) und zum Vornehmen von Anpassungen der Geschwindigkeit und Richtung eines autonomen zweiten Fahrzeugs (200), wobei das Verfahren Folgendes umfasst:

source: operating a computing device, the computing device configured to:
de_de: Betreiben einer Rechenvorrichtung, wobei die Rechenvorrichtung konfiguriert ist, um:

source: receive one or more identifiers of the first vehicle (100);
de_de: eine oder mehrere Kennungen des ersten Fahrzeugs (100) zu empfangen;

source: identify the first vehicle (100) based on the one or more identifiers; and
de_de: das erste Fahrzeug (100) basierend auf der einen oder den mehreren Kennungen zu identifizieren; und

source: determine from a vehicle database (400) whether the identified first vehicle (100) has Advanced Driver Assistance Systems (ADAS) features;
de_de: aus einer Fahrzeugdatenbank (400) zu bestimmen, ob das identifizierte erste Fahrzeug (100) über Merkmale fortgeschrittener Fahrerassistenzsysteme (ADAS) verfügt;

source: wherein the autonomous second vehicle (200) is configured to:
de_de: wobei das autonome zweite Fahrzeug (200) konfiguriert ist, um:

source: determine the ADAS features of the first vehicle (100) which is within the ambit of the autonomous second vehicle (200); and
de_de: die ADAS-Merkmale des ersten Fahrzeugs (100), das sich in der Umgebung des autonomen zweiten Fahrzeugs (200) befindet, zu bestimmen; und

source: in the event the autonomous second vehicle (200) requires a sudden change of direction or speed in order to avoid a collision with another vehicle which has ADAS features or which does not have ADAS features or any other obstacle:
de_de: für den Fall, dass das autonome zweite Fahrzeug (200) eine plötzliche Richtungs- oder Geschwindigkeitsänderung benötigt, um eine Kollision mit einem anderen Fahrzeug, das über ADAS-Merkmale verfügt oder nicht über ADAS-Merkmale verfügt, oder mit einem anderen Hindernis zu vermeiden:

source: estimate how the first vehicle will react based on the determined ADAS features of the first vehicle (100); and
de_de: abzuschätzen, wie das erste Fahrzeug basierend auf der bestimmten ADAS-Merkmale des ersten Fahrzeugs (100) reagieren wird; und

source: make requisite adjustments to the speed and direction of the autonomous second vehicle (200).
de_de: erforderliche Anpassungen der Geschwindigkeit und Richtung des autonomen zweiten Fahrzeugs (200) vorzunehmen.

source: 2. The method of claim 1, wherein the computing device resides on a cloud-based computer, the method comprising transmitting the result of determining whether the identified first vehicle (100) has ADAS features to the autonomous second vehicle (200)
de_de: 2. Verfahren nach Anspruch 1, wobei sich die Rechenvorrichtung auf einem cloudbasierten Computer befindet, das Verfahren Übertragen des Ergebnisses des Bestimmens, ob das identifizierte erste Fahrzeug (100) ADAS-Merkmale aufweist, an das autonome zweite Fahrzeug (200) umfasst

source: and, optionally, wherein the autonomous second vehicle (200) communicates with the computing device via a Vehicle-to-External communication capability.
de_de: und wobei das autonome zweite Fahrzeug (200) optional mit der Rechenvorrichtung über eine Fahrzeug-zu-extern-Kommunikationsfähigkeit kommuniziert.

source: 3. The method of claim 1, wherein the computing device is disposed in the autonomous second vehicle (200) and, optionally, the method comprising receiving the result of determining whether the identified first vehicle has Advanced Driver Assistance Systems features at the autonomous second vehicle (200).
de_de: 3. Verfahren nach Anspruch 1, wobei die Rechenvorrichtung in dem autonomen zweiten Fahrzeug (200) angeordnet ist und das Verfahren optional Empfangen des Ergebnisses des Bestimmens, ob das identifizierte erste Fahrzeug über Merkmale fortgeschrittener Fahrerassistenzsysteme verfügt, in dem autonomen zweiten Fahrzeug (200), umfasst.

source: 4. The method of any of claims 1 to 3, wherein the autonomous second vehicle (200) is a Highly Autonomous Vehicle.
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei das autonome zweite Fahrzeug (200) ein hochautonomes Fahrzeug ist.

source: 5. The method of any preceding claim, wherein the one or more identifiers comprise one or more of a full or partial vehicle registration number, make (102), model (103), and colour (104) of the first vehicle (100).
de_de: 5. Verfahren nach einem der vorhergehenden Ansprüche, wobei die eine oder die mehreren Kennungen eines oder mehrere der folgenden Elemente umfassen: vollständiges oder unvollständiges Kennzeichen, Marke (102), Modell (103) oder Farbe (104) des ersten Fahrzeugs (100).

source: 6. The method of any preceding claim, comprising identifying the first vehicle based on a partial vehicle registration number (105) and at least one other identifier comprising a make (102), model (103), and colour (104) of the first vehicle (100) and/or identifying the first vehicle (100) as having a specific Vehicle Identification Number.
de_de: 6. Verfahren nach einem der vorhergehenden Ansprüche, umfassend Identifizieren des ersten Fahrzeugs basierend auf einem unvollständigen Kennzeichens (105) und mindestens einer anderen Kennung, umfassend eine Marke (102), ein Modell (103) und eine Farbe (104) des ersten Fahrzeugs (100) und/oder Identifizieren des ersten Fahrzeugs (100) als ein Fahrzeug mit einer bestimmten Fahrzeugidentifizierungsnummer.

source: 7. The method of any preceding claim, wherein the vehicle database comprises a list of Vehicle Identification Numbers cross-referenced to Vehicle Manufacturer Data.
de_de: 7. Verfahren nach einem der vorhergehenden Ansprüche, wobei die Fahrzeugdatenbank eine Liste von Fahrzeugidentifizierungsnummern mit Querverweisen auf Fahrzeugherstellerdaten umfasst.

source: 8. The method of claim 7, wherein the vehicle database comprises vehicle makes and models with Advanced Driver Assistance Systems attributes and/or vehicle makes and models with no Advanced Driver Assistance Systems attributes.
de_de: 8. Verfahren nach Anspruch 7, wobei die Fahrzeugdatenbank Fahrzeugmarken und -modelle mit Merkmalen fortgeschrittener Fahrerassistenzsysteme und/oder Fahrzeugmarken und -modelle ohne Merkmale fortgeschrittener Fahrerassistenzsysteme umfasst.

source: 9. The method of any of claims 3 to 8, wherein the second vehicle communicates with the first vehicle via a Vehicle-to-Vehicle communication capability.
de_de: 9. Verfahren nach einem der Ansprüche 3 bis 8, wobei das zweite Fahrzeug mit dem ersten Fahrzeug über eine Fahrzeug-zu-Fahrzeug-Kommunikationsfähigkeit kommuniziert.

source: The method of any preceding claim, wherein the one or more identifiers of the first vehicle are captured using an Automatic Number Plate Recognition imaging device installed in the second vehicle and, optionally, wherein the one or more identifiers comprises of a full or partial vehicle registration number, make, model, colour, and a tread-depth of any visible tyre on the first vehicle captured using the Automatic Number Plate Recognition imaging device.
de_de: Verfahren nach einem der vorhergehenden Ansprüche, wobei die eine oder die mehreren Kennungen des ersten Fahrzeugs mithilfe einer Bildgebungsvorrichtung für automatische Nummernschilderkennung, die in dem zweiten Fahrzeug installiert ist, erfasst werden und wobei die eine oder die mehreren Kennungen optional ein vollständiges oder unvollständiges Kennzeichen, die Marke, das Modell, die Farbe und eine Profiltiefe jedes sichtbaren Reifens des ersten Fahrzeugs umfassen, die mithilfe der Bildgebungsvorrichtung für automatische Nummernschilderkennung erfasst werden.

source: The method of any preceding claim, comprising determining, by the computing device, that the identified first vehicle (100) is a Highly Autonomous Vehicle.
de_de: Verfahren nach einem der vorhergehenden Ansprüche, umfassend Bestimmen durch die Rechenvorrichtung, dass das identifizierte erste Fahrzeug (100) ein hochautonomes Fahrzeug ist.

source: The method of any of claims 1 to 10, comprising determining, by the computing device, that the identified first vehicle (100) is not a Highly Autonomous Vehicle.
de_de: Verfahren nach einem der Ansprüche 1 bis 10, umfassend Bestimmen durch die Rechenvorrichtung, dass das identifizierte erste Fahrzeug (100) kein hochautonomes Fahrzeug ist.

source: The method of claim 12, wherein, it is determined that the first vehicle is equipped with Advanced Driver Assistance Systems features or it is determined that the first vehicle is not equipped with Advanced Driver Assistance Systems features.
de_de: Verfahren nach Anspruch 12, wobei bestimmt wird, dass das erste Fahrzeug mit Merkmalen fortgeschrittener Fahrerassistenzsysteme ausgestattet ist, oder bestimmt wird, dass das erste Fahrzeug nicht mit Merkmalen fortgeschrittener Fahrerassistenzsysteme ausgestattet ist.

source: A system comprising:
de_de: System, umfassend:

source: a vehicle database comprising a list of Vehicle Identification Numbers cross-referenced to Vehicle Manufacturer Data;
de_de: eine Fahrzeugdatenbank, umfassend eine Liste von Fahrzeugidentifizierungsnummern mit Querverweisen auf Fahrzeugherstellerdaten;

source: a computing device and an autonomous second vehicle configured to carry out the method of any of claims 1-13.
de_de: eine Rechenvorrichtung und ein autonomes zweites Fahrzeug, die konfiguriert sind, um das Verfahren nach einem der Ansprüche 1–13 durchzuführen.

source: 1. A burner device (190) comprising:
de_de: 1. Brennervorrichtung (190), umfassend:

source: an air intake (201);
de_de: einen Lufteinlass (201);

source: a burner head (192) including an ignition device (193);
de_de: einen Brennerkopf (192) mit einer Zündvorrichtung (193);

source: a fan housing (194);
de_de: ein Gebläsegehäuse (194);

source: a body section (196) interconnecting the burner head and the fan housing, and defining a fluid flow channel (198) between said air intake and said burner head;
de_de: einen Körperabschnitt (196), der den Brennerkopf und das Gebläsegehäuse miteinander verbindet und einen Fluidströmungskanal (198) zwischen dem Lufteinlass und dem Brennerkopf definiert;

source: a gas injector (205) for injecting combustible gas into said fluid flow channel; and
de_de: eine Gaseinspritzdüse (205) zum Einspritzen von brennbarem Gas in den Fluidströmungskanal; und

source: at least one resonance chamber (240, 242) shaped and dimensioned such that fluid inside it resonates, in use, at a respective selected resonant frequency, the, or each, resonance chamber having a fluid inlet (244, 246) to allow fluid communication between the respective chamber and the burner device,
de_de: mindestens eine Resonanzkammer (240, 242), die derart geformt und dimensioniert ist, dass Fluid in ihrem Inneren im Betrieb bei einer jeweiligen ausgewählten Resonanzfrequenz resoniert, wobei die oder jede Resonanzkammer einen Fluideinlass (244, 246) aufweist, um eine Fluidverbindung zwischen der jeweiligen Kammer und der Brennervorrichtung zu ermöglichen,

source: wherein the burner head comprises a body (211) shaped to define a mixing chamber (213), the mixing chamber having an inlet (215) by which a mixture of combustible gas and air is received in use from the fluid flow channel, and an outlet (217) by which said mixture of combustible gas and air is directed to the ignition device,
de_de: wobei der Brennerkopf einen Körper (211) umfasst, der derart geformt ist, dass er eine Mischkammer (213) definiert, wobei die Mischkammer einen Einlass (215), durch den ein Gemisch aus brennbarem Gas und Luft im Betrieb aus dem Fluidströmungskanal aufgenommen wird, und einen Auslass (217), durch den das Gemisch aus brennbarem Gas und Luft auf die Zündvorrichtung gerichtet wird, aufweist,

source: and wherein the fluid inlet of the, or each, resonance chamber opens into the mixing chamber and wherein the transverse cross sectional area of the mixing chamber is larger than the transverse cross sectional area of the fluid flow channel,
de_de: und wobei der Fluideinlass der oder jeder Resonanzkammer in die Mischkammer mündet und wobei die Querschnittsfläche der Mischkammer größer ist als die Querschnittsfläche des Fluidströmungskanals,

source: characterized in that the burner head is oriented such that its longitudinal axis is substantially perpendicular to the plane in which said channel is defined and in which fluid flows, in use, along said channel, the fan housing and body section being mutually oriented to be substantially coplanar, the body section being shaped such that the fluid flow channel is curved, and wherein the mixing chamber inlet comprises a plurality of spaced apart apertures (215') formed in a wall (211') between the fluid flow channel and the mixing chamber and the mixing chamber outlet being oppositely located with respect to the mixing chamber inlet.
de_de: dadurch gekennzeichnet, dass der Brennerkopf derart ausgerichtet ist, dass seine Längsachse im Wesentlichen senkrecht zu der Ebene ist, in der der Kanal definiert ist und in der Fluid im Betrieb entlang des Kanals fließt, wobei das Gebläsegehäuse und der Körperabschnitt derart aneinander ausgerichtet sind, dass sie im Wesentlichen koplanar sind, wobei der Körperabschnitt derart geformt ist, dass der Fluidströmungskanal gekrümmt ist, und wobei der Mischkammereinlass eine Vielzahl von beabstandeten Öffnungen (215') umfasst, die in einer Wand (211') zwischen dem Fluidströmungskanal und der Mischkammer ausgebildet sind, und der Mischkammerauslass in Bezug auf den Mischkammereinlass gegenüberliegend angeordnet ist.

source: 2. The burner device (190) of claim 1, wherein said inlet (244, 246) is provided by a tube located in the resonance chamber.
de_de: 2. Brennervorrichtung (190) nach Anspruch 1, wobei der Einlass (244, 246) durch ein in dem Resonanzraum angeordnetes Rohr bereitgestellt ist.

source: 3. The burner device (190) of any preceding claim, wherein the, or each, resonance chamber (240, 242) is a Helmholtz resonator.
de_de: 3. Brennervorrichtung (190) nach einem der vorhergehenden Ansprüche, wobei die oder jede Resonanzkammer (240, 242) ein Helmholtz-Resonator ist.

source: 4. The burner device (190) of any preceding claim, wherein the respective resonant frequency corresponds to a resonant frequency of the burner device.
de_de: 4. Brennervorrichtung (190) nach einem der vorhergehenden Ansprüche, wobei die jeweilige Resonanzfrequenz einer Resonanzfrequenz der Brennervorrichtung entspricht.

source: 5. The burner device (190) of any preceding claim, wherein said at least one resonance chamber (240, 242) comprises first and second resonance chambers, each of said resonance chambers being shaped and dimensioned such that fluid inside it resonates, in use, at a respective different resonant frequency.
de_de: 5. Brennervorrichtung (190) nach einem der vorhergehenden Ansprüche, wobei die mindestens eine Resonanzkammer (240, 242) eine erste und eine zweite Resonanzkammer umfasst, wobei jede der Resonanzkammern derart geformt und dimensioniert ist, dass das Fluid in ihr im Betrieb mit einer jeweils unterschiedlichen Resonanzfrequenz resoniert.

source: 6. A burner device (190) as claimed in any preceding claim, wherein the fan housing (194) houses a fan (195) and includes said air intake (201) and an air outlet (203) in fluid communication with said fluid flow channel (198), the configuration being such that, in use, the fan draws air into the burner device through said air intake and supplies the drawn air to the fluid flow channel via said air outlet.
de_de: 6. Brennervorrichtung (190) nach einem der vorhergehenden Ansprüche, wobei das Gebläsegehäuse (194) ein Gebläse (195) beherbergt und den Lufteinlass (201) und einen Luftauslass (203) in Fluidverbindung mit dem Fluidströmungskanal (198) aufweist, wobei die Konfiguration derart ist, dass das Gebläse im Betrieb Luft durch den Lufteinlass in die Brennervorrichtung ansaugt und die angesaugte Luft über den Luftauslass dem Fluidströmungskanal zuführt.

source: 7. A burner device (190) as claimed in any preceding claim, wherein said body section (196) is separably formed from said burner head (192), and wherein, preferably, said body section comprises first and second parts joined together to form said fluid flow channel (198).
de_de: 7. Brennervorrichtung (190) nach einem der vorhergehenden Ansprüche, wobei der Körperabschnitt (196) von dem Brennerkopf (192) trennbar ausgebildet ist, und wobei der Körperabschnitt vorzugsweise einen ersten und einen zweiten Teil umfasst, die miteinander gefügt sind, um den Fluidströmungskanal (198) auszubilden.

source: 8. A burner device (190) as claimed in claim 7, wherein said body section (196) is formed from polymeric or plastics material.
de_de: 8. Brennervorrichtung (190) nach Anspruch 7, wobei der Körperabschnitt (196) aus Polymer- oder Kunststoffmaterial ausgebildet ist.

source: 9. A burner device (190) as claimed in claim 7 or 8, wherein said burner head (190) is metallic.
de_de: 9. Brennervorrichtung (190) nach Anspruch 7 oder 8, wobei der Brennerkopf (190) metallisch ist.

source: A heating apparatus (20, 120, 120') comprising: a tank (132) having a tank inlet (134), a tank outlet (136), a heat exchanger inlet (173, 173') and heat exchanger outlet (175, 175'); a heat exchanger (170, 170') located in said tank and comprising a hollow body (176, 176') having a mouth (172, 172') coupled to said heat exchanger inlet and a flue outlet (174, 174') coupled to said heat exchanger outlet; and a burner device (190) as claimed in any preceding claim, said burner head (192) being at least partly located in said mouth inside said hollow body, and wherein the or each resonant frequency of said at least one resonance chamber (240, 242) corresponds to a resonant frequency of the heating apparatus.
de_de: Erwärmungsvorrichtung (20, 120, 120'), umfassend: einen Tank (132) mit einem Tankeinlass (134), einem Tankauslass (136), einem Wärmetauschereinlass (173, 173') und einem Wärmetauscherauslass (175, 175'); einen Wärmetauscher (170, 170'), der in dem Tank angeordnet ist und einen Hohlkörper (176, 176') umfasst mit einer mit dem Wärmetauschereinlass gekoppelte Mündung (172, 172') und einem mit dem Wärmetauscherauslass gekoppelten Abgasauslass (174, 174'); und eine Brennervorrichtung (190) nach einem der vorhergehenden Ansprüche, wobei der Brennerkopf (192) mindestens teilweise in der Mündung innerhalb des Hohlkörpers angeordnet ist, und wobei die oder jede Resonanzfrequenz der mindestens einen Resonanzkammer (240, 242) einer Resonanzfrequenz der Erwärmungsvorrichtung entspricht.
